In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.722588 -0.135287 -0.228525  0.710964
2013-01-02 -0.649216  1.017898 -0.627567  0.496842
2013-01-03 -0.437638  0.839993 -1.165712  0.259320
2013-01-04 -0.608628 -1.256368 -0.565088  1.734118
2013-01-05 -0.556050  0.034723  2.036195 -1.480254
2013-01-06 -1.226616  0.421710  0.843545  0.912847

In [7]:
df2 = pd.DataFrame({'A':1,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(["test","train","test","train"]),
                    'F': 'foo'})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df.head()

                   A         B         C         D
2013-01-01 -1.722588 -0.135287 -0.228525  0.710964
2013-01-02 -0.649216  1.017898 -0.627567  0.496842
2013-01-03 -0.437638  0.839993 -1.165712  0.259320
2013-01-04 -0.608628 -1.256368 -0.565088  1.734118
2013-01-05 -0.556050  0.034723  2.036195 -1.480254

In [11]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.608628 -1.256368 -0.565088  1.734118
2013-01-05 -0.556050  0.034723  2.036195 -1.480254
2013-01-06 -1.226616  0.421710  0.843545  0.912847

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.values

array([[-1.72258785, -0.13528736, -0.22852527,  0.71096392],
       [-0.64921574,  1.01789772, -0.62756704,  0.49684195],
       [-0.43763846,  0.83999274, -1.16571207,  0.25932035],
       [-0.60862824, -1.25636761, -0.56508782,  1.73411787],
       [-0.55604999,  0.03472299,  2.03619459, -1.48025412],
       [-1.22661646,  0.42171018,  0.84354484,  0.91284706]])

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.866789  0.153778  0.048808  0.438973
std    0.501315  0.821660  1.180478  1.067239
min   -1.722588 -1.256368 -1.165712 -1.480254
25%   -1.082266 -0.092785 -0.611947  0.318701
50%   -0.628922  0.228217 -0.396807  0.603903
75%   -0.569195  0.735422  0.575527  0.862376
max   -0.437638  1.017898  2.036195  1.734118

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.722588   -0.649216   -0.437638   -0.608628   -0.556050   -1.226616
B   -0.135287    1.017898    0.839993   -1.256368    0.034723    0.421710
C   -0.228525   -0.627567   -1.165712   -0.565088    2.036195    0.843545
D    0.710964    0.496842    0.259320    1.734118   -1.480254    0.912847

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.710964 -0.228525 -0.135287 -1.722588
2013-01-02  0.496842 -0.627567  1.017898 -0.649216
2013-01-03  0.259320 -1.165712  0.839993 -0.437638
2013-01-04  1.734118 -0.565088 -1.256368 -0.608628
2013-01-05 -1.480254  2.036195  0.034723 -0.556050
2013-01-06  0.912847  0.843545  0.421710 -1.226616

In [19]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06 -1.226616  0.421710  0.843545  0.912847
2013-01-05 -0.556050  0.034723  2.036195 -1.480254
2013-01-04 -0.608628 -1.256368 -0.565088  1.734118
2013-01-03 -0.437638  0.839993 -1.165712  0.259320
2013-01-02 -0.649216  1.017898 -0.627567  0.496842
2013-01-01 -1.722588 -0.135287 -0.228525  0.710964

In [30]:
df.sort_index(by='B')

D:\Program Soft\Anaconda\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

                   A         B         C         D
2013-01-04 -0.608628 -1.256368 -0.565088  1.734118
2013-01-01 -1.722588 -0.135287 -0.228525  0.710964
2013-01-05 -0.556050  0.034723  2.036195 -1.480254
2013-01-06 -1.226616  0.421710  0.843545  0.912847
2013-01-03 -0.437638  0.839993 -1.165712  0.259320
2013-01-02 -0.649216  1.017898 -0.627567  0.496842

In [31]:
df['A']

2013-01-01   -1.722588
2013-01-02   -0.649216
2013-01-03   -0.437638
2013-01-04   -0.608628
2013-01-05   -0.556050
2013-01-06   -1.226616
Freq: D, Name: A, dtype: float64

In [32]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.722588 -0.135287 -0.228525  0.710964
2013-01-02 -0.649216  1.017898 -0.627567  0.496842
2013-01-03 -0.437638  0.839993 -1.165712  0.259320

In [33]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.649216  1.017898 -0.627567  0.496842
2013-01-03 -0.437638  0.839993 -1.165712  0.259320
2013-01-04 -0.608628 -1.256368 -0.565088  1.734118

In [34]:
df.loc[dates[0]]

A   -1.722588
B   -0.135287
C   -0.228525
D    0.710964
Name: 2013-01-01 00:00:00, dtype: float64

In [35]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.722588 -0.135287
2013-01-02 -0.649216  1.017898
2013-01-03 -0.437638  0.839993
2013-01-04 -0.608628 -1.256368
2013-01-05 -0.556050  0.034723
2013-01-06 -1.226616  0.421710